avmwww/ittrium/config/tms320c67px/tms320c67px.h
#ifndef _TMS320C67PX_H_
#define _TMS320C67PX_H_


extern cregister volatile unsigned int ISTP; //Interrupt set register
extern cregister volatile unsigned int IRP;  //Interrupt return pointer
extern cregister volatile unsigned int NRP;  //Nonmaskable interrupt return pointer
extern cregister volatile unsigned int FADCR;//(C6700 only) Floating-point adder configuration register
extern cregister volatile unsigned int FAUCR;//(C6700 only) Floating-point auxiliary configuration register
extern cregister volatile unsigned int FMCR; //(C6700 only) Floating-point multiplier configuration register
extern cregister volatile unsigned int IFR;  //Interrupt flag register
extern cregister volatile unsigned int ISR;  //Interrupt set register
extern cregister volatile unsigned int ICR;  //Interrupt clear register
extern cregister volatile unsigned int IER;  //Interrupt enable register
extern cregister volatile unsigned int AMR;  //Addressing mode register
extern cregister volatile unsigned int CSR;  //Control status register
extern cregister volatile unsigned int DETR; //d MAX register
extern cregister volatile unsigned int DESR; //d MAX register

#define _CSR_GIE        0
#define _CSR_PGIE       1
#define _CSR_DCC        2
#define _CSR_PCC        5
#define _CSR_EN         8
#define _CSR_SAT        9
#define _CSR_PWRD       10
#define _CSR_REVID      16
#define _CSR_CPUID      24

#define CSR_GIE         0x00000001
#define CSR_PGIE        0x00000002
#define CSR_DCC         0x00000004
#define CSR_PCC         0x00000020
#define CSR_EN          0x00000100
#define CSR_SAT         0x00000200
#define CSR_PWRD        0x00000400
#define CSR_REVID       0x00010000
#define CSR_CPUID       0x01000000

#define INTR_ENABLE(n)  IER |= 0x1<<(n)
#define INTR_DISABLE(n) IER &= ~(0x1<<(n))
#define INTR_CLEAR(n)   ICR  = 0x1<<(n)

/*******************************************************************************
 Interrupt Selector Registers
 *******************************************************************************/
//Interrupt event
#define IEV_DSPINT      0x00 //HPI
#define IEV_TINT0       0x01 //Timer 0
#define IEV_TINT1       0x02 //Timer 1
#define IEV_SDINT       0x03 //EMIF 
#define IEV_GPINT4      0x04 //GPIO   
#define IEV_GPINT5      0x05 //GPIO   
#define IEV_GPINT6      0x06 //GPIO   
#define IEV_GPINT7      0x07 //GPIO   
#define IEV_EDMAINT     0x08 //EDMA   
#define IEV_EMUDTDMA    0x09 //Emulation    
#define IEV_EMURTDXRX   0x0A //Emulation     
#define IEV_EMURTDXTX   0x0B //Emulation     
#define IEV_XINT0       0x0C //McBSP0 
#define IEV_RINT0       0x0D //McBSP0 
#define IEV_XINT1       0x0E //McBSP1 
#define IEV_RINT1       0x0F //McBSP1 
#define IEV_GPINT0      0x10 //GPIO  
#define IEV_I2CINT0     0x16 //I2C0   
#define IEV_I2CINT1     0x17 //I2C1   
#define IEV_AXINT0      0x1C //McASP0  
#define IEV_ARINT0      0x1D //McASP0  
#define IEV_AXINT1      0x1E //McASP1  
#define IEV_ARINT1      0x1F //McASP1  
// Interrupt number
#define RESET_INT_NO            0x00
#define NMI_INT_NO              0x01
#define GPIO4_INT_NO            0x04
#define GPIO5_INT_NO            0x05 
#define GPIO6_INT_NO            0x06 
#define GPIO7_INT_NO            0x07 
#define EDMA_INT_NO             0x08 
#define EMUDTDMA_INT_NO         0x09 
#define SD_INT_NO               0x10 
#define EMURTDXRX_INT_NO        0x11
#define EMURTDXTX_INT_NO        0x12 
#define DSP_INT_NO              0x13 
#define TIMER0_INT_NO           0x14 
#define TIMER1_INT_NO           0x15 

/*******************************************************************************
 Timers Registers / RTI module registers
 *******************************************************************************/
#define CFGRTI          *(volatile unsigned int*)(0x40000014)

#define RTIGCTRL        *(volatile unsigned int*)(0x42000000)
#define RTICAPCTRL      *(volatile unsigned int*)(0x42000008)
#define RTICOMPCTRL     *(volatile unsigned int*)(0x4200000C)
#define RTIFRC0         *(volatile unsigned int*)(0x42000010)
#define RTIUC0          *(volatile unsigned int*)(0x42000014)
#define RTICPUC0        *(volatile unsigned int*)(0x42000018)
#define RTICAFRC0       *(volatile unsigned int*)(0x42000020)
#define RTICAUC0        *(volatile unsigned int*)(0x42000024)
#define RTIFRC1         *(volatile unsigned int*)(0x42000030)
#define RTIUC1          *(volatile unsigned int*)(0x42000034)
#define RTICPUC1        *(volatile unsigned int*)(0x42000038)
#define RTICAFRC1       *(volatile unsigned int*)(0x42000040)
#define RTICAUC1        *(volatile unsigned int*)(0x42000044)
#define RTICOMP0        *(volatile unsigned int*)(0x42000050)
#define RTIUDCP0        *(volatile unsigned int*)(0x42000054)
#define RTICOMP1        *(volatile unsigned int*)(0x42000058)
#define RTIUDCP1        *(volatile unsigned int*)(0x4200005C)
#define RTICOMP2        *(volatile unsigned int*)(0x42000060)
#define RTIUDCP2        *(volatile unsigned int*)(0x42000064)
#define RTICOMP3        *(volatile unsigned int*)(0x42000068)
#define RTIUDCP3        *(volatile unsigned int*)(0x4200006C)
#define RTISETINT       *(volatile unsigned int*)(0x42000080)
#define RTICLEARINT     *(volatile unsigned int*)(0x42000084)
#define RTIINTFLAG      *(volatile unsigned int*)(0x42000088)
#define RTIDWDCTRL      *(volatile unsigned int*)(0x42000090)
#define RTIDWDPRLD      *(volatile unsigned int*)(0x42000094)
#define RTIWDSTATUS     *(volatile unsigned int*)(0x42000098)
#define RTIWDKEY        *(volatile unsigned int*)(0x4200009C)
#define RTIDWDCNTR      *(volatile unsigned int*)(0x420000A0)
 
// 
#define ENABLE_RTI0_INT()      INTR_ENABLE(4)
#define DISABLE_RTI0_INT()     INTR_DISABLE(4)

/*******************************************************************************
 PLL Controller Registers 
 *******************************************************************************/
#define PLLPID          *(volatile unsigned int*)(0x41000000)
#define PLLCSR          *(volatile unsigned int*)(0x41000100)
#define PLLM            *(volatile unsigned int*)(0x41000110)
#define PLLDIV0         *(volatile unsigned int*)(0x41000114)
#define PLLDIV1         *(volatile unsigned int*)(0x41000118)
#define PLLDIV2         *(volatile unsigned int*)(0x4100011C)
#define PLLDIV3         *(volatile unsigned int*)(0x41000120)
#define PLLCMD          *(volatile unsigned int*)(0x41000138)
#define PLLSTAT         *(volatile unsigned int*)(0x4100013C)
#define ALNCTL          *(volatile unsigned int*)(0x41000140)
#define CKEN            *(volatile unsigned int*)(0x41000148)
#define CKSTAT          *(volatile unsigned int*)(0x4100014C)
#define SYSTAT          *(volatile unsigned int*)(0x41000150)

#define PLLCSR_PLLEN    0x01
#define PLLCSR_PLLPWRDN 0x02
#define PLLCSR_PLLRST   0x08
#define PLLCSR_STABLE   0x40

#define PLLDIV_D_EN     0x00008000
/*******************************************************************************
 Device Configuration
 *******************************************************************************/
#define CFGPIN0     *(volatile unsigned int*)0x40000000
#define CFGPIN1     *(volatile unsigned int*)0x40000004
#define CFGHPI      *(volatile unsigned int*)0x40000008
#define CFGHPIAMSB  *(volatile unsigned int*)0x4000000C
#define CFGHPIAUMB  *(volatile unsigned int*)0x40000010

#define CFGMCASP1   *(volatile unsigned int*)0x4000001C
#define CFGMCASP2   *(volatile unsigned int*)0x40000020
#define CFGBRIDGE   *(volatile unsigned int*)0x40000024

