avmwww/ittrium/config/tms320c67px/tms320c67px.h
/*******************************************************************************
 Cache Configuration
 *******************************************************************************/
#define L1PSAR *(volatile unsigned int *)(0x20000000)
#define L1PICR *(volatile unsigned int *)(0x20000004)
#define L1P_INVALIDATE (0x80000000)
#define PCC_ENABLE0 (0x00000000)
#define PCC_ENABLE (0x00000040)
#define PCC_FREEZE (0x00000060)
#define PCC_BYPASS (0x00000080)
#define PCC_MASK (0x000000E0)

/*******************************************************************************
 EMIF Registers
 *******************************************************************************/
#define AWCCR       *(volatile unsigned int*)0xF0000004
#define SDCR        *(volatile unsigned int*)0xF0000008
#define SDRCR       *(volatile unsigned int*)0xF000000C
#define A1CR        *(volatile unsigned int*)0xF0000010
#define SDTIMR      *(volatile unsigned int*)0xF0000020
#define SDSRETR     *(volatile unsigned int*)0xF000003C
#define EIRR        *(volatile unsigned int*)0xF0000040
#define EIMR        *(volatile unsigned int*)0xF0000044
#define EIMSR       *(volatile unsigned int*)0xF0000048
#define EIMCR       *(volatile unsigned int*)0xF000004C
#define NANDFCR     *(volatile unsigned int*)0xF0000060
#define NANDFSR     *(volatile unsigned int*)0xF0000064
#define NANDF1ECC   *(volatile unsigned int*)0xF0000070
 

#define ASIZE_8BIT              0x00000000
#define ASIZE_16BIT             0x00000001
#define ASIZE_32BIT             0x00000002

#define TA(x)                   ((x)<<2)
#define R_HOLD(x)               ((x)<<4)
#define R_STROBE(x)             ((x)<<7)
#define R_SETUP(x)              ((x)<<13)
#define W_HOLD(x)               ((x)<<17)
#define W_STROBE(x)             ((x)<<20)
#define W_SETUP(x)              ((x)<<26)

#define WAIT_CYCLES             0x40000000
#define SELECT_STROBE_MODE      0x80000000



#define CECTL_RDHLD(x)          (x)
#define CECTL_MTYPE(x)          ((x)<<4)
#define CECTL_RDSTRB(x)         ((x)<<8)
#define CECTL_TA(x)             ((x)<<14)
#define CECTL_RDSETUP(x)        ((x)<<16)
#define CECTL_WRHLD(x)          ((x)<<20)
#define CECTL_WRSTRB(x)         ((x)<<22)
#define CECTL_WRSETUP(x)        ((x)<<28)

/*******************************************************************************
 I2C Registers
 *******************************************************************************/

//I2C0 Registers
#define I2COAR0         *(volatile unsigned int*)(0x49000000)   //I2C0 own address register
#define I2CIER0         *(volatile unsigned int*)(0x49000004)   //I2C0 interrupt enable register
#define I2CSTR0         *(volatile unsigned int*)(0x49000008)   //I2C0 interrupt status register
#define I2CCLKL0        *(volatile unsigned int*)(0x4900000C)   //I2C0 clock low-time divider register
#define I2CCLKH0        *(volatile unsigned int*)(0x49000010)   //I2C0 clock high-time divider register
#define I2CCNT0         *(volatile unsigned int*)(0x49000014)   //I2C0 data count register
#define I2CDRR0         *(volatile unsigned int*)(0x49000018)   //I2C0 data receive register
#define I2CSAR0         *(volatile unsigned int*)(0x4900001C)   //I2C0 slave address register
#define I2CDXR0         *(volatile unsigned int*)(0x49000020)   //I2C0 data transmit register
#define I2CMDR0         *(volatile unsigned int*)(0x49000024)   //I2C0 mode register
#define I2CISRC0        *(volatile unsigned int*)(0x49000028)   //I2C0 interrupt source register
#define I2CEMDR0        *(volatile unsigned int*)(0x4900002C)   //I2C0 Extended Mode Register
#define I2CPSC0         *(volatile unsigned int*)(0x49000030)   //I2C0 prescaler register
#define I2CPID1_0       *(volatile unsigned int*)(0x49000034)   //I2C0 Peripheral Identification Register 1
#define I2CPID2_0       *(volatile unsigned int*)(0x49000038)   //I2C0 Peripheral Identification Register 2
#define I2CPFUNC0       *(volatile unsigned int*)(0x49000048)   //I2C0 Pin Function Register
#define I2CPDIR0        *(volatile unsigned int*)(0x4900004C)   //I2C0 Pin Direction Register
#define I2CPDIN0        *(volatile unsigned int*)(0x49000050)   //I2C0 Pin Data Input Register
#define I2CPDOUT0       *(volatile unsigned int*)(0x49000054)   //I2C0 Pin Data Output Register
#define I2CPDSET0       *(volatile unsigned int*)(0x49000058)   //I2C0 Pin Data Set Register
#define I2CPDCLR0       *(volatile unsigned int*)(0x4900005C)   //I2C0 Pin Data Clear Register

//I2C1 Registers
#define I2COAR1         *(volatile unsigned int*)(0x4A000000)   //I2C1 own address register
#define I2CIER1         *(volatile unsigned int*)(0x4A000004)   //I2C1 interrupt enable register
#define I2CSTR1         *(volatile unsigned int*)(0x4A000008)   //I2C1 interrupt status register
#define I2CCLKL1        *(volatile unsigned int*)(0x4A00000C)   //I2C1 clock low-time divider register
#define I2CCLKH1        *(volatile unsigned int*)(0x4A000010)   //I2C1 clock high-time divider register
#define I2CCNT1         *(volatile unsigned int*)(0x4A000014)   //I2C1 data count register
#define I2CDRR1         *(volatile unsigned int*)(0x4A000018)   //I2C1 data receive register
#define I2CSAR1         *(volatile unsigned int*)(0x4A00001C)   //I2C1 slave address register
#define I2CDXR1         *(volatile unsigned int*)(0x4A000020)   //I2C1 data transmit register
#define I2CMDR1         *(volatile unsigned int*)(0x4A000024)   //I2C1 mode register
#define I2CISRC1        *(volatile unsigned int*)(0x4A000028)   //I2C1 interrupt source register
#define I2CEMDR1        *(volatile unsigned int*)(0x4A00002C)   //I2C1 Extended Mode Register
#define I2CPSC1         *(volatile unsigned int*)(0x4A000030)   //I2C1 prescaler register
#define I2CPID1_1       *(volatile unsigned int*)(0x4A000034)   //I2C1 Peripheral Identification Register 1
#define I2CPID2_1       *(volatile unsigned int*)(0x4A000038)   //I2C1 Peripheral Identification Register 2
#define I2CPFUNC1       *(volatile unsigned int*)(0x4A000048)   //I2C1 Pin Function Register
#define I2CPDIR1        *(volatile unsigned int*)(0x4A00004C)   //I2C1 Pin Direction Register
#define I2CPDIN1        *(volatile unsigned int*)(0x4A000050)   //I2C1 Pin Data Input Register
#define I2CPDOUT1       *(volatile unsigned int*)(0x4A000054)   //I2C1 Pin Data Output Register
#define I2CPDSET1       *(volatile unsigned int*)(0x4A000058)   //I2C1 Pin Data Set Register
#define I2CPDCLR1       *(volatile unsigned int*)(0x4A00005C)   //I2C1 Pin Data Clear Register

//I2C ~ I2C0
#define I2COAR          I2COAR1
//I2C Interrupt Enable Register
#define I2CIER          I2CIER1
#define I2CIER_AL       0x01
#define I2CIER_NACK     0x02
#define I2CIER_ARDY     0x04
#define I2CIER_ICRRDY   0x08
#define I2CIER_RRDY     I2CIER_ICRRDY
#define I2CIER_ICXRDY   0x10
#define I2CIER_XRDY     I2CIER_ICXRDY
#define I2CIER_SCD      0x20

//I2C Status Register
#define I2CSTR          I2CSTR1
#define I2CSTR_AL       0x0001
#define I2CSTR_NACK     0x0002
#define I2CSTR_ARDY     0x0004
#define I2CSTR_ICRRDY   0x0008
#define I2CSTR_RRDY     I2CSTR_ICRRDY
#define I2CSTR_ICXRDY   0x0010
#define I2CSTR_XRDY     I2CSTR_ICXRDY
#define I2CSTR_AD0      0x0100
#define I2CSTR_AAS      0x0200
#define I2CSTR_XSMT     0x0400
#define I2CSTR_RSFULL   0x0800
#define I2CSTR_BB       0x1000
#define I2CSTR_NACKSNT  0x2000
//                
#define I2CCLKL         I2CCLKL1
#define I2CCLKH         I2CCLKH1
#define I2CCNT          I2CCNT1 
#define I2CDRR          I2CDRR1 
#define I2CSAR          I2CSAR1 
#define I2CDXR          I2CDXR1 
//I2C Mode Register
#define I2CMDR          I2CMDR1
#define _I2CMDR_BC      0x0000
#define I2CMDR_FDF      0x0008
#define I2CMDR_STB      0x0010
#define I2CMDR_IRS      0x0020
#define I2CMDR_DLB      0x0040
#define I2CMDR_RM       0x0080
#define I2CMDR_XA       0x0100
#define I2CMDR_TRX      0x0200
#define I2CMDR_MST      0x0400
#define I2CMDR_STP      0x0800
#define I2CMDR_STT      0x2000
#define I2CMDR_FREE     0x4000
#define I2CMDR_NACKMOD  0x8000
//I2C Interrupt Source Register
#define I2CISRC                 I2CISRC1
#define I2CISRC_INTCODE         0x07
#define I2CISRC_INTCODE_ARDY    0x3
#define I2CISRC_INTCODE_RRDY    0x4
#define I2CISRC_INTCODE_XRDY    0x5 
#define I2CISRC_INTCODE_SCD     0x6
//
#define I2CPSC          I2CPSC1 
//
#define I2CEMDR         I2CEMDR0

