avmwww/ittrium/config/tms320c67px/tms320c67px.h
/*******************************************************************************
 McASP0 and McASP1 Registers
 *******************************************************************************/
// McASP0
#define CFGMCASP0   *(volatile unsigned int*)0x40000018

#define PID0        *(volatile unsigned int*)0x44000000
#define PWRDEMU0    *(volatile unsigned int*)0x44000004
#define PFUNC0      *(volatile unsigned int*)0x44000010
#define PDIR0       *(volatile unsigned int*)0x44000014
#define PDOUT0      *(volatile unsigned int*)0x44000018
#define PDIN0       *(volatile unsigned int*)0x4400001C
#define PDSET0      *(volatile unsigned int*)0x4400001C
#define PDCLR0      *(volatile unsigned int*)0x44000020

#define GBLCTL0     *(volatile unsigned int*)0x44000044
#define AMUTE0      *(volatile unsigned int*)0x44000048
#define DLBCTL0     *(volatile unsigned int*)0x4400004C
#define DITCTL0     *(volatile unsigned int*)0x44000050
#define RGBLCTL0    *(volatile unsigned int*)0x44000060
#define RMASK0      *(volatile unsigned int*)0x44000064
#define RFMT0       *(volatile unsigned int*)0x44000068
#define AFSRCTL0    *(volatile unsigned int*)0x4400006C
#define ACLKRCTL0   *(volatile unsigned int*)0x44000070
#define AHCLKRCTL0  *(volatile unsigned int*)0x44000074
#define RTDM0       *(volatile unsigned int*)0x44000078
#define RINTCTL0    *(volatile unsigned int*)0x4400007C
#define RSTAT0      *(volatile unsigned int*)0x44000080
#define RSLOT0      *(volatile unsigned int*)0x44000084
#define RCLKCHK0    *(volatile unsigned int*)0x44000088
#define REVTCTL0    *(volatile unsigned int*)0x4400008C
#define XGBLCTL0    *(volatile unsigned int*)0x440000A0
#define XMASK0      *(volatile unsigned int*)0x440000A4
#define XFMT0       *(volatile unsigned int*)0x440000A8
#define AFSXCTL0    *(volatile unsigned int*)0x440000AC
#define ACLKXCTL0   *(volatile unsigned int*)0x440000B0
#define AHCLKXCTL0  *(volatile unsigned int*)0x440000B4
#define XTDM0       *(volatile unsigned int*)0x440000B8
#define XINTCTL0    *(volatile unsigned int*)0x440000BC
#define XSTAT0      *(volatile unsigned int*)0x440000C0
#define XSLOT0      *(volatile unsigned int*)0x440000C4
#define XCLKCHK0    *(volatile unsigned int*)0x440000C8
#define XEVTCTL0    *(volatile unsigned int*)0x440000CC

#define SRCTL0_0    *(volatile unsigned int*)0x44000180
#define SRCTL0_1    *(volatile unsigned int*)0x44000184
#define SRCTL0_2    *(volatile unsigned int*)0x44000188
#define SRCTL0_3    *(volatile unsigned int*)0x4400018C
#define SRCTL0_4    *(volatile unsigned int*)0x44000190
#define SRCTL0_5    *(volatile unsigned int*)0x44000194
#define SRCTL0_6    *(volatile unsigned int*)0x44000198
#define SRCTL0_7    *(volatile unsigned int*)0x4400019C
#define SRCTL0_8    *(volatile unsigned int*)0x440001A0
#define SRCTL0_9    *(volatile unsigned int*)0x440001A4
#define SRCTL0_10   *(volatile unsigned int*)0x440001A8
#define SRCTL0_11   *(volatile unsigned int*)0x440001AC
#define SRCTL0_12   *(volatile unsigned int*)0x440001B0
#define SRCTL0_13   *(volatile unsigned int*)0x440001B4
#define SRCTL0_14   *(volatile unsigned int*)0x440001B8
#define SRCTL0_15   *(volatile unsigned int*)0x440001BC

#define XBUF0_0     *(volatile unsigned int*)0x44000200
#define XBUF0_1     *(volatile unsigned int*)0x44000204
#define XBUF0_2     *(volatile unsigned int*)0x44000208
#define XBUF0_3     *(volatile unsigned int*)0x4400020C
#define XBUF0_4     *(volatile unsigned int*)0x44000210
#define XBUF0_5     *(volatile unsigned int*)0x44000214
#define XBUF0_6     *(volatile unsigned int*)0x44000218
#define XBUF0_7     *(volatile unsigned int*)0x4400021C
#define XBUF0_8     *(volatile unsigned int*)0x44000220
#define XBUF0_9     *(volatile unsigned int*)0x44000224
#define XBUF0_10    *(volatile unsigned int*)0x44000228
#define XBUF0_11    *(volatile unsigned int*)0x4400022C
#define XBUF0_12    *(volatile unsigned int*)0x44000230
#define XBUF0_13    *(volatile unsigned int*)0x44000234
#define XBUF0_14    *(volatile unsigned int*)0x44000238
#define XBUF0_15    *(volatile unsigned int*)0x4400023C

#define RBUF0_0     *(volatile unsigned int*)0x44000280
#define RBUF0_1     *(volatile unsigned int*)0x44000284
#define RBUF0_2     *(volatile unsigned int*)0x44000288
#define RBUF0_3     *(volatile unsigned int*)0x4400028C
#define RBUF0_4     *(volatile unsigned int*)0x44000290
#define RBUF0_5     *(volatile unsigned int*)0x44000294
#define RBUF0_6     *(volatile unsigned int*)0x44000298
#define RBUF0_7     *(volatile unsigned int*)0x4400029C
#define RBUF0_8     *(volatile unsigned int*)0x440002A0
#define RBUF0_9     *(volatile unsigned int*)0x440002A4
#define RBUF0_10    *(volatile unsigned int*)0x440002A8
#define RBUF0_11    *(volatile unsigned int*)0x440002AC
#define RBUF0_12    *(volatile unsigned int*)0x440002B0
#define RBUF0_13    *(volatile unsigned int*)0x440002B4
#define RBUF0_14    *(volatile unsigned int*)0x440002B8
#define RBUF0_15    *(volatile unsigned int*)0x440002BC

// McASP1
#define CFGMCASP1   *(volatile unsigned int*)0x4000001C

#define PID1        *(volatile unsigned int*)0x45000000
#define PWRDEMU1    *(volatile unsigned int*)0x45000004
#define PFUNC1      *(volatile unsigned int*)0x45000010
#define PDIR1       *(volatile unsigned int*)0x45000014
#define PDOUT1      *(volatile unsigned int*)0x45000018
#define PDIN1       *(volatile unsigned int*)0x4500001C
#define PDSET1      *(volatile unsigned int*)0x4500001C
#define PDCLR1      *(volatile unsigned int*)0x45000020

#define GBLCTL1     *(volatile unsigned int*)0x45000044
#define AMUTE1      *(volatile unsigned int*)0x45000048
#define DLBCTL1     *(volatile unsigned int*)0x4500004C
#define DITCTL1     *(volatile unsigned int*)0x45000050
#define RGBLCTL1    *(volatile unsigned int*)0x45000060
#define RMASK1      *(volatile unsigned int*)0x45000064
#define RFMT1       *(volatile unsigned int*)0x45000068
#define AFSRCTL1    *(volatile unsigned int*)0x4500006C
#define ACLKRCTL1   *(volatile unsigned int*)0x45000070
#define AHCLKRCTL1  *(volatile unsigned int*)0x45000074
#define RTDM1       *(volatile unsigned int*)0x45000078
#define RINTCTL1    *(volatile unsigned int*)0x4500007C
#define RSTAT1      *(volatile unsigned int*)0x45000080
#define RSLOT1      *(volatile unsigned int*)0x45000084
#define RCLKCHK1    *(volatile unsigned int*)0x45000088
#define REVTCTL1    *(volatile unsigned int*)0x4500008C
#define XGBLCTL1    *(volatile unsigned int*)0x450000A0
#define XMASK1      *(volatile unsigned int*)0x450000A4
#define XFMT1       *(volatile unsigned int*)0x450000A8
#define AFSXCTL1    *(volatile unsigned int*)0x450000AC
#define ACLKXCTL1   *(volatile unsigned int*)0x450000B0
#define AHCLKXCTL1  *(volatile unsigned int*)0x450000B4
#define XTDM1       *(volatile unsigned int*)0x450000B8
#define XINTCTL1    *(volatile unsigned int*)0x450000BC
#define XSTAT1      *(volatile unsigned int*)0x450000C0
#define XSLOT1      *(volatile unsigned int*)0x450000C4
#define XCLKCHK1    *(volatile unsigned int*)0x450000C8
#define XEVTCTL1    *(volatile unsigned int*)0x450000CC

#define SRCTL1_0    *(volatile unsigned int*)0x45000180
#define SRCTL1_1    *(volatile unsigned int*)0x45000184
#define SRCTL1_2    *(volatile unsigned int*)0x45000188
#define SRCTL1_3    *(volatile unsigned int*)0x4500018C
#define SRCTL1_4    *(volatile unsigned int*)0x45000190
#define SRCTL1_5    *(volatile unsigned int*)0x45000194

#define XBUF1_0     *(volatile unsigned int*)0x45000200
#define XBUF1_1     *(volatile unsigned int*)0x45000204
#define XBUF1_2     *(volatile unsigned int*)0x45000208
#define XBUF1_3     *(volatile unsigned int*)0x4500020C
#define XBUF1_4     *(volatile unsigned int*)0x45000210
#define XBUF1_5     *(volatile unsigned int*)0x45000214

#define RBUF1_0     *(volatile unsigned int*)0x45000280
#define RBUF1_1     *(volatile unsigned int*)0x45000284
#define RBUF1_2     *(volatile unsigned int*)0x45000288
#define RBUF1_3     *(volatile unsigned int*)0x4500028C
#define RBUF1_4     *(volatile unsigned int*)0x45000290
#define RBUF1_5     *(volatile unsigned int*)0x45000294



