avmwww/ittrium/config/tms320c67px/tms320c67px.h
// McASP2
#define CFGMCASP2   *(volatile unsigned int*)0x40000020

#define PID2        *(volatile unsigned int*)0x46000000
#define PWRDEMU2    *(volatile unsigned int*)0x46000004
#define PFUNC2      *(volatile unsigned int*)0x46000010
#define PDIR2       *(volatile unsigned int*)0x46000014
#define PDOUT2      *(volatile unsigned int*)0x46000018
#define PDIN2       *(volatile unsigned int*)0x4600001C
#define PDSET2      *(volatile unsigned int*)0x4600001C
#define PDCLR2      *(volatile unsigned int*)0x46000020

#define GBLCTL2     *(volatile unsigned int*)0x46000044
#define AMUTE2      *(volatile unsigned int*)0x46000048
#define DLBCTL2     *(volatile unsigned int*)0x4600004C
#define DITCTL2     *(volatile unsigned int*)0x46000050
#define RGBLCTL2    *(volatile unsigned int*)0x46000060
#define RMASK2      *(volatile unsigned int*)0x46000064
#define RFMT2       *(volatile unsigned int*)0x46000068
#define AFSRCTL2    *(volatile unsigned int*)0x4600006C
#define ACLKRCTL2   *(volatile unsigned int*)0x46000070
#define AHCLKRCTL2  *(volatile unsigned int*)0x46000074
#define RTDM2       *(volatile unsigned int*)0x46000078
#define RINTCTL2    *(volatile unsigned int*)0x4600007C
#define RSTAT2      *(volatile unsigned int*)0x46000080
#define RSLOT2      *(volatile unsigned int*)0x46000084
#define RCLKCHK2    *(volatile unsigned int*)0x46000088
#define REVTCTL2    *(volatile unsigned int*)0x4600008C
#define XGBLCTL2    *(volatile unsigned int*)0x460000A0
#define XMASK2      *(volatile unsigned int*)0x460000A4
#define XFMT2       *(volatile unsigned int*)0x460000A8
#define AFSXCTL2    *(volatile unsigned int*)0x460000AC
#define ACLKXCTL2   *(volatile unsigned int*)0x460000B0
#define AHCLKXCTL2  *(volatile unsigned int*)0x460000B4
#define XTDM2       *(volatile unsigned int*)0x460000B8
#define XINTCTL2    *(volatile unsigned int*)0x460000BC
#define XSTAT2      *(volatile unsigned int*)0x460000C0
#define XSLOT2      *(volatile unsigned int*)0x460000C4
#define XCLKCHK2    *(volatile unsigned int*)0x460000C8
#define XEVTCTL2    *(volatile unsigned int*)0x460000CC

#define SRCTL2_0    *(volatile unsigned int*)0x46000180
#define SRCTL2_1    *(volatile unsigned int*)0x46000184

#define XBUF2_0     *(volatile unsigned int*)0x46000200
#define XBUF2_1     *(volatile unsigned int*)0x46000204

#define RBUF2_0     *(volatile unsigned int*)0x46000280
#define RBUF2_1     *(volatile unsigned int*)0x46000284

#define DITCSRA0    *(volatile unsigned int*)0x46000100
#define DITCSRA1    *(volatile unsigned int*)0x46000104
#define DITCSRA2    *(volatile unsigned int*)0x46000108
#define DITCSRA3    *(volatile unsigned int*)0x4600010C
#define DITCSRA4    *(volatile unsigned int*)0x46000110
#define DITCSRA5    *(volatile unsigned int*)0x46000114
#define DITCSRB0    *(volatile unsigned int*)0x46000118
#define DITCSRB1    *(volatile unsigned int*)0x4600011C
#define DITCSRB2    *(volatile unsigned int*)0x46000120
#define DITCSRB3    *(volatile unsigned int*)0x46000124
#define DITCSRB4    *(volatile unsigned int*)0x46000128
#define DITCSRB5    *(volatile unsigned int*)0x4600012C
#define DITUDRA0    *(volatile unsigned int*)0x46000130
#define DITUDRA1    *(volatile unsigned int*)0x46000134
#define DITUDRA2    *(volatile unsigned int*)0x46000138
#define DITUDRA3    *(volatile unsigned int*)0x4600013C
#define DITUDRA4    *(volatile unsigned int*)0x46000140
#define DITUDRA5    *(volatile unsigned int*)0x46000144
#define DITUDRB0    *(volatile unsigned int*)0x46000148
#define DITUDRB1    *(volatile unsigned int*)0x4600014C
#define DITUDRB2    *(volatile unsigned int*)0x46000150
#define DITUDRB3    *(volatile unsigned int*)0x46000154
#define DITUDRB4    *(volatile unsigned int*)0x46000158
#define DITUDRB5    *(volatile unsigned int*)0x4600015C

//--
//--
//--
//------------------------------------------------------------------------------
// SPCR
//------------------------------------------------------------------------------
#define SPCR_RRST       0x00000001
#define SPCR_RRDY       0x00000002
#define SPCR_RFULL      0x00000004
#define SPCR_RSYNCERR   0x00000008
#define SPCR_RINTM(x)   ((x)<<4)
#define SPCR_DXENA      0x00000080
#define SPCR_CLKSTP(x)  ((x)<<11)
#define SPCR_RJUST(x)   ((x)<<13)
#define SPCR_DLB        0x00008000
#define SPCR_XRST       0x00010000
#define SPCR_XRDY       0x00020000
#define SPCR_XEMPTY     0x00040000
#define SPCR_XSYNCERR   0x00080000
#define SPCR_XINTM(x)   ((x)<<20)
#define SPCR_GRST       0x00400000
#define SPCR_FRST       0x00800000
#define SPCR_SOFT       0x01000000
#define SPCR_FREE       0x02000000

#define _SPCR_RRST       0
#define _SPCR_RRDY       1
#define _SPCR_RFULL      2
#define _SPCR_RSYNCERR   3
#define _SPCR_RINTM      4
#define _SPCR_DXENA      7
#define _SPCR_CLKSTP    11
#define _SPCR_RJUST     13
#define _SPCR_DLB       15
#define _SPCR_XRST      16
#define _SPCR_XRDY      17
#define _SPCR_XEMPTY    18
#define _SPCR_XSYNCERR  19
#define _SPCR_XINTM     20
#define _SPCR_GRST      22
#define _SPCR_FRST      23
#define _SPCR_SOFT      24
#define _SPCR_FREE      25
//------------------------------------------------------------------------------
// RCR
//------------------------------------------------------------------------------
#define RXCR_PHASE_SINGLE       0x00000000
#define RXCR_PHASE_DUAL         0x80000000
#define RXCR_PHASE(x)           ((x)<<31)
#define RXCR_FRLEN2(x)          ((x)<<24)
#define RXCR_WDLEN2_8           0x00000000
#define RXCR_WDLEN2_12          0x00200000
#define RXCR_WDLEN2_16          0x00400000
#define RXCR_WDLEN2_20          0x00600000
#define RXCR_WDLEN2_24          0x00800000
#define RXCR_WDLEN2_32          0x00A00000
#define RXCR_WDLEN2(x)          ((x)<<21)
#define RXCR_RCOMPAND_MSB       0x00000000
#define RXCR_RCOMPAND_8BITLSB   0x00080000
#define RXCR_RCOMPAND_ULAW      0x00100000
#define RXCR_RCOMPAND_ALAW      0x00180000
#define RXCR_RCOMPAND(x)        ((x)<<19)
#define RXCR_RFIG               0x00040000
#define RXCR_DATDLY_0BIT        0x00000000
#define RXCR_DATDLY_1BIT        0x00010000
#define RXCR_DATDLY_2BIT        0x00020000
#define RXCR_DATDLY(x)          ((x)<<16)
#define RXCR_PHASE2_NORMAL      0x00000000
#define RXCR_PHASE2_OPPOSITE    0x00008000
#define RXCR_FRLEN1(x)          ((x)<<8)
#define RXCR_WDLEN1_8           0x00000000
#define RXCR_WDLEN1_12          0x00000020
#define RXCR_WDLEN1_16          0x00000040
#define RXCR_WDLEN1_20          0x00000060
#define RXCR_WDLEN1_24          0x00000080
#define RXCR_WDLEN1_32          0x000000A0
#define RXCR_WDLEN1(x)          ((x)<<5)
#define RXCR_WDREVRS            0x00000010

#define _RXCR_WDREVRS            4
#define _RXCR_WDLEN1             5
#define _RXCR_FRLEN1             8
#define _RXCR_DATDLY            16
#define _RXCR_RFIG              18
#define _RXCR_RCOMPAND          19
#define _RXCR_WDLEN2            21
#define _RXCR_FRLEN2            24
#define _RXCR_PHASE             31
//------------------------------------------------------------------------------
// SRGR
//------------------------------------------------------------------------------
#define SRGR_CLKGDV(x)          (x)
#define SRGR_FWID(x)            ((x)<<8)
#define SRGR_FPER(x)            ((x)<<16)
#define SRGR_FSGM               0x10000000
#define SRGR_CLKSM              0x20000000
#define SRGR_CLKSP              0x40000000
#define SRGR_GSYNC              0x80000000

#define _SRGR_CLKGDV             0
#define _SRGR_FWID               8
#define _SRGR_FPER              16
#define _SRGR_FSGM              28
#define _SRGR_CLKSM             29
#define _SRGR_CLKSP             30
#define _SRGR_GSYNC             31
//------------------------------------------------------------------------------
// MCR
//------------------------------------------------------------------------------
#define MCR_RMCM                0x00000001
#define MCR_RCBLK(x)            ((x)<<2)
#define MCR_RPABLK(x)           ((x)<<5)
#define MCR_RPBBLK(x)           ((x)<<7)
#define MCR_RMCME               0x00002000
#define MCR_XMCM                0x00010000
#define MCR_XCBLK(x)            ((x)<<18)
#define MCR_XPABLK(x)           ((x)<<21)
#define MCR_XPBBLK(x)           ((x)<<23)
#define MCR_XMCME               0x02000000

#define _MCR_RMCM                0
#define _MCR_RCBLK               2
#define _MCR_RPABLK              5
#define _MCR_RPBBLK              7
#define _MCR_RMCME               9
#define _MCR_XMCM               16
#define _MCR_XCBLK              18
#define _MCR_XPABLK             21
#define _MCR_XPBBLK             23
//------------------------------------------------------------------------------
// PCR
//------------------------------------------------------------------------------
#define PCR_CLKRP               0x00000001
#define PCR_CLKXP               0x00000002
#define PCR_FSRP                0x00000004
#define PCR_FSXP                0x00000008
#define PCR_DRSTAT              0x00000010
#define PCR_DXSTAT              0x00000020
#define PCR_CLKSSTAT            0x00000040
#define PCR_CLKRM               0x00000100
#define PCR_CLKXM               0x00000200
#define PCR_FSRM                0x00000400
#define PCR_FSXM                0x00000800
#define PCR_RIOEN               0x00001000
#define PCR_XIOEN               0x00002000

#define _PCR_CLKRP               0
#define _PCR_CLKXP               1
#define _PCR_FSRP                2
#define _PCR_FSXP                3
#define _PCR_DR_STAT             4
#define _PCR_DX_STAT             5
#define _PCR_CLKS_STAT           6
#define _PCR_CLKRM               8
#define _PCR_CLKXM               9
#define _PCR_FSRM               10
#define _PCR_FSXM               11
#define _PCR_RIOEN              12
#define _PCR_XIOEN              13
/*******************************************************************************
 McASP0 and McASP1 Registers
 *******************************************************************************/
#define MCASP(n)                ((n)*0x00004000+0x01B4C000)
#define MCASP0                  (0x01B4C000)
#define MCASP1                  (0x01B50000)
//
#define MCASP0_MCASPPID         *(volatile unsigned int*)(MCASP0)
#define MCASP1_MCASPPID         *(volatile unsigned int*)(MCASP1)

#define MCASP_PWRDEMU(n)        *(volatile unsigned int*)(MCASP(n)+0x0004)
#define MCASP0_PWRDEMU          *(volatile unsigned int*)(MCASP0+0x0004)
#define MCASP1_PWRDEMU          *(volatile unsigned int*)(MCASP1+0x0004)

// Pin
#define PIN_AXR_0             0x00000001
#define PIN_AXR_1             0x00000002
#define PIN_AXR_2             0x00000004
#define PIN_AXR_3             0x00000008
#define PIN_AXR_4             0x00000010
#define PIN_AXR_5             0x00000020
#define PIN_AXR_6             0x00000040
#define PIN_AXR_7             0x00000080
#define PIN_AXR_8             0x00000100
#define PIN_AXR_9             0x00000200
#define PIN_AXR_10            0x00000400
#define PIN_AXR_11            0x00000800
#define PIN_AXR_12            0x00001000
#define PIN_AXR_13            0x00002000
#define PIN_AXR_14            0x00004000
#define PIN_AXR_15            0x00008000
#define PIN_AMUTE             0x02000000
#define PIN_ACLKX             0x04000000
#define PIN_AHCLKX            0x08000000
#define PIN_AFSX              0x10000000
#define PIN_ACLKR             0x20000000
#define PIN_AHCLKR            0x40000000
#define PIN_AFSR              0x80000000

#define MCASPGPIO_AXR_0         0x00000001
#define MCASPGPIO_AXR_1         0x00000002
#define MCASPGPIO_AXR_2         0x00000004
#define MCASPGPIO_AMUTE         0x02000000
#define MCASPGPIO_ACLKX         0x04000000
#define MCASPGPIO_AHCLKX        0x08000000
#define MCASPGPIO_AFSX          0x10000000
#define MCASPGPIO_ACLKR         0x20000000
#define MCASPGPIO_AHCLKR        0x40000000
#define MCASPGPIO_AFSR          0x80000000

