avmwww/ittrium/config/tms320c67px/tms320c67px.h
#define _MCASPGPIO_AXR(n)       (n)
#define _MCASPGPIO_AMUTE        25
#define _MCASPGPIO_ACLKX        26
#define _MCASPGPIO_AHCLKX       27
#define _MCASPGPIO_AFSX         28
#define _MCASPGPIO_ACLKR        29
#define _MCASPGPIO_AHCLKR       30
#define _MCASPGPIO_AFSR         31

#define _GBLCTL_RCLKRST          0
#define _GBLCTL_RHCLKRST         1
#define _GBLCTL_RSRCLR           2
#define _GBLCTL_RSMRST           3
#define _GBLCTL_RFRST            4
#define _GBLCTL_XCLKRST          8
#define _GBLCTL_XHCLKRST         9
#define _GBLCTL_XSRCLR          10
#define _GBLCTL_XSMRST          11
#define _GBLCTL_XFRST           12

#define GBLCTL_RCLKRST          0x00000001
#define GBLCTL_RHCLKRST         0x00000002
#define GBLCTL_RSRCLR           0x00000004
#define GBLCTL_RSMRST           0x00000008
#define GBLCTL_RFRST            0x00000010
#define GBLCTL_XCLKRST          0x00000100
#define GBLCTL_XHCLKRST         0x00000200
#define GBLCTL_XSRCLR           0x00000400
#define GBLCTL_XSMRST           0x00000800
#define GBLCTL_XFRST            0x00001000
//Audio Mute Control Register
#define MCASP_AMUTE(n)          *(volatile unsigned int*)(MCASP(n)+0x0048)

#define AMUTE_MUTEN             0
#define AMUTE_INPOL             2
#define AMUTE_INEN              3
#define AMUTE_INSTAT            4
#define AMUTE_ROVRN             5
#define AMUTE_XUNDRN            6
#define AMUTE_RSYNCERR          7
#define AMUTE_XSYNCERR          8
#define AMUTE_RCKFAIL           9
#define AMUTE_XCKFAIL          10
#define AMUTE_RDMAERR          11
#define AMUTE_XDMAERR          12

#define _AMUTE_MUTEN             0
#define _AMUTE_INPOL             2
#define _AMUTE_INEN              3
#define _AMUTE_INSTAT            4
#define _AMUTE_ROVRN             5
#define _AMUTE_XUNDRN            6
#define _AMUTE_RSYNCERR          7
#define _AMUTE_XSYNCERR          8
#define _AMUTE_RCKFAIL           9
#define _AMUTE_XCKFAIL          10
#define _AMUTE_RDMAERR          11
#define _AMUTE_XDMAERR          12
// Digital Loopback Control Register
#define MCASP_DLBCTL(n)         *(volatile unsigned int*)(MCASP(n)+0x004C)

#define DLBCTL_DLBEN            0x00000001
#define DLBCTL_ORD              0x00000002
#define DLBCTL_MODE             0x00000004

#define _DLBCTL_DLBEN           0
#define _DLBCTL_ORD             1
#define _DLBCTL_MODE            2

//DIT Mode Control Register
#define MCASP_DITCTL(n)         *(volatile unsigned int*)(MCASP(n)+0x0050)

#define DITCTL_DITEN            0x00000001
#define DITCTL_VA               0x00000004
#define DITCTL_VB               0x00000008

#define _DITCTL_DITEN            0
#define _DITCTL_VA               2
#define _DITCTL_VB               3

#define XFMT_ROT(x)             (x)
#define XFMT_ROT_0              0x00000000
#define XFMT_ROT_4              0x00000001
#define XFMT_ROT_8              0x00000002
#define XFMT_ROT_12             0x00000003
#define XFMT_ROT_16             0x00000004
#define XFMT_ROT_20             0x00000005
#define XFMT_ROT_24             0x00000006
#define XFMT_ROT_28             0x00000007
#define XFMT_BUSEL              0x00000008
#define XFMT_SSZ(x)             ((x)<<4)
#define XFMT_SSZ_8              0x00000030
#define XFMT_SSZ_12             0x00000050
#define XFMT_SSZ_16             0x00000070
#define XFMT_SSZ_20             0x00000090
#define XFMT_SSZ_24             0x000000B0
#define XFMT_SSZ_28             0x000000D0
#define XFMT_SSZ_32             0x000000F0
#define XFMT_PBIT(x)            ((x)<<8)
#define XFMT_PAD(x)             ((x)<<13)
#define XFMT_RVRS               0x00008000
#define XFMT_DATDLY(x)          ((x)<<16)

#define RFMT_ROT(x)             (x)
#define RFMT_RBUSEL             0x00000008
#define RFMT_ROT_0              0x00000000
#define RFMT_ROT_4              0x00000001
#define RFMT_ROT_8              0x00000002
#define RFMT_ROT_12             0x00000003
#define RFMT_ROT_16             0x00000004
#define RFMT_ROT_20             0x00000005
#define RFMT_ROT_24             0x00000006
#define RFMT_ROT_28             0x00000007
#define RFMT_BUSEL              0x00000008
#define RFMT_SSZ(x)             ((x)<<4)
#define RFMT_SSZ_8              0x00000030
#define RFMT_SSZ_12             0x00000050
#define RFMT_SSZ_16             0x00000070
#define RFMT_SSZ_20             0x00000090
#define RFMT_SSZ_24             0x000000B0
#define RFMT_SSZ_28             0x000000D0
#define RFMT_SSZ_32             0x000000F0
#define RFMT_PBIT(x)            ((x)<<8)
#define RFMT_PAD(x)             ((x)<<13)
#define RFMT_RVRS               0x00008000
#define RFMT_DATDLY(x)          ((x)<<16)

#define _XFMT_ROT                0
#define _XFMT_BUSEL              3
#define _XFMT_SSZ                4
#define _XFMT_PBIT               8
#define _XFMT_PAD               13
#define _XFMT_RVRS              15
#define _XFMT_DATDLY            16

#define _RFMT_ROT                0
#define _RFMT_BUSEL              3
#define _RFMT_SSZ                4
#define _RFMT_PBIT               8
#define _RFMT_PAD               13
#define _RFMT_RVRS              15
#define _RFMT_DATDLY            16

#define AFSXCTL_FSXP            0x00000001
#define AFSXCTL_FSXM            0x00000002
#define AFSXCTL_FXWID           0x00000010
#define AFSXCTL_XMOD(x)         ((x)<<7)

#define AFSRCTL_FSRP            0x00000001
#define AFSRCTL_FSRM            0x00000002
#define AFSRCTL_FRWID           0x00000010
#define AFSRCTL_RMOD(x)         ((x)<<7)

#define _AFSXCTL_FSXP           0
#define _AFSXCTL_FSXM           1
#define _AFSXCTL_FXWID          4
#define _AFSXCTL_XMOD           7

#define _AFSRCTL_FSRP           0
#define _AFSRCTL_FSRM           1
#define _AFSRCTL_FRWID          4
#define _AFSRCTL_RMOD           7

#define ACLKXCTL_CLKXDIV(x)     (x)
#define ACLKXCTL_CLKXM          0x00000020
#define ACLKXCTL_ASYNC          0x00000040
#define ACLKXCTL_CLKXP          0x00000080

