avmwww/ittrium/config/tms320c67px/tms320c67px.h
#define ACLKRCTL_CLKRDIV(x)     (x)
#define ACLKRCTL_CLKRM          0x00000020
#define ACLKRCTL_ASYNC          0x00000040
#define ACLKRCTL_CLKRP          0x00000080

#define _ACLKXCTL_CLKXDIV       0
#define _ACLKXCTL_CLKXM         5
#define _ACLKXCTL_ASYNC         6
#define _ACLKXCTL_CLKXP         7

#define _ACLKRCTL_CLKRDIV       0
#define _ACLKRCTL_CLKRM         5
#define _ACLKRCTL_ASYNC         6
#define _ACLKRCTL_CLKRP         7

#define AHCLKXCTL_HCLKXDIV(x)   (x)
#define AHCLKXCTL_HCLKXP        0x00004000
#define AHCLKXCTL_HCLKXM        0x00008000

#define AHCLKRCTL_HCLKRDIV(x)   (x)
#define AHCLKRCTL_HCLKRP        0x00004000
#define AHCLKRCTL_HCLKRM        0x00008000

#define _AHCLKXCTL_HCLKXDIV      0
#define _AHCLKXCTL_HCLKXP       14
#define _AHCLKXCTL_HCLKXM       15

#define _AHCLKRCTL_HCLKRDIV      0
#define _AHCLKRCTL_HCLKRP       14
#define _AHCLKRCTL_HCLKRM       15

#define XINTCTL_XUNDRN          0x00000001
#define XINTCTL_XSYNCERR        0x00000002
#define XINTCTL_XCKFAIL         0x00000004
#define XINTCTL_XDMAERR         0x00000008
#define XINTCTL_XLAST           0x00000010
#define XINTCTL_XDATA           0x00000020
#define XINTCTL_XSTAFRM         0x00000080

#define RINTCTL_RUNDRN          0x00000001
#define RINTCTL_RSYNCERR        0x00000002
#define RINTCTL_RCKFAIL         0x00000004
#define RINTCTL_RDMAERR         0x00000008
#define RINTCTL_RLAST           0x00000010
#define RINTCTL_RDATA           0x00000020
#define RINTCTL_RSTAFRM         0x00000080

#define _XINTCTL_XUNDRN         0
#define _XINTCTL_XSYNCERR       1
#define _XINTCTL_XCKFAIL        2
#define _XINTCTL_XDMAERR        3
#define _XINTCTL_XLAST          4
#define _XINTCTL_XDATA          5
#define _XINTCTL_XSTAFRM        7

#define _RINTCTL_RUNDRN         0
#define _RINTCTL_RSYNCERR       1
#define _RINTCTL_RCKFAIL        2
#define _RINTCTL_RDMAERR        3
#define _RINTCTL_RLAST          4
#define _RINTCTL_RDATA          5
#define _RINTCTL_RSTAFRM        7

#define _STAT_OVUNDRN       0
#define _STAT_SYNCERR       1
#define _STAT_CKFAIL        2
#define _STAT_TDMSLOT       3
#define _STAT_LAST          4
#define _STAT_DATA          5
#define _STAT_STAFRM        6
#define _STAT_DMAERR        7
#define _STAT_ERR           8

#define _SLOT_SLOTCNT           0

#define XCLKCHK_XPS(x)          (x)
#define XCLKCHK_XPS_1           0x00000000
#define XCLKCHK_XPS_2           0x00000001
#define XCLKCHK_XPS_4           0x00000002
#define XCLKCHK_XPS_8           0x00000003
#define XCLKCHK_XPS_16          0x00000004
#define XCLKCHK_XPS_32          0x00000005
#define XCLKCHK_XPS_64          0x00000006
#define XCLKCHK_XPS_128         0x00000007
#define XCLKCHK_XPS_256         0x00000008
#define XCLKCHK_XCKFAILSW       0x00000080
#define XCLKCHK_XMIN(x)         ((x)<<8)
#define XCLKCHK_XMAX(x)         ((x)<<16)
#define XCLKCHK_XCNT(x)         ((x)<<24)

#define RCLKCHK_RPS(x)          (x)
#define RCLKCHK_RPS_1           0x00000000
#define RCLKCHK_RPS_2           0x00000001
#define RCLKCHK_RPS_4           0x00000002
#define RCLKCHK_RPS_8           0x00000003
#define RCLKCHK_RPS_16          0x00000004
#define RCLKCHK_RPS_32          0x00000005
#define RCLKCHK_RPS_64          0x00000006
#define RCLKCHK_RPS_128         0x00000007
#define RCLKCHK_RPS_256         0x00000008
#define RCLKCHK_RMIN(x)         ((x)<<8)
#define RCLKCHK_RMAX(x)         ((x)<<16)
#define RCLKCHK_RCNT(x)         ((x)<<24)

#define _XCLKCHK_XPS             0
#define _XCLKCHK_XCKFAILSW       7
#define _XCLKCHK_XMIN            8
#define _XCLKCHK_XMAX           16
#define _XCLKCHK_XCNT           24

#define _RCLKCHK_RPS             0
#define _RCLKCHK_RMIN            8
#define _RCLKCHK_RMAX           16
#define _RCLKCHK_RCNT           24

#define SRCTL_SRMOD(x)          (x)
#define SRCTL_DISMOD(x)         ((x)<<2)
#define SRCTL_XRDY              0x00000010
#define SRCTL_RRDY              0x00000020

#define _SRCTL_SRMOD            0
#define _SRCTL_DISMOD           2
#define _SRCTL_XRDY             4
#define _SRCTL_RRDY             5

//DIT Left Channel Status Registers 
#define MCASP_DITCSRA(n, t)     *(volatile unsigned int*)(MCASP(n)+0x0100+(t)*4)
//DIT Right Channel Status Registers 
#define MCASP_DITCSRB(n, t)     *(volatile unsigned int*)(MCASP(n)+0x0118+(t)*4)
//DIT Left Channel User Data Registers
#define MCASP_DITUDRA(n, t)     *(volatile unsigned int*)(MCASP(n)+0x0130+(t)*4)
//DIT Right Channel User Data Registers
#define MCASP_DITUDRB(n, t)     *(volatile unsigned int*)(MCASP(n)+0x0148+(t)*4)
//Transmit Buffer Registers
#define MCASP_XBUF(n, t)        *(volatile unsigned int*)(MCASP(n)+0x0200+(t)*4)
//Receive Buffer Registers
#define MCASP_RBUF(n, t)        *(volatile unsigned int*)(MCASP(n)+0x0280+(t)*4)
//
#define MCASP_XRBUF(n)          *(volatile unsigned int*)(0x3c000000 + (n)*0x00100000)
#define MCASP_RBUF_XBUF(n, r)   *(volatile unsigned int*)(0x3c000000 + (n)*0x00100000 + (r)*4)
/*******************************************************************************
dMAX Peripheral Registers
 *******************************************************************************/
#define DEPR                    *(volatile unsigned int*)0x60000008
#define DEER                    *(volatile unsigned int*)0x6000000C
#define DEDR                    *(volatile unsigned int*)0x60000010
#define DEHPR                   *(volatile unsigned int*)0x60000014
#define DELPR                   *(volatile unsigned int*)0x60000018
#define DEFR                    *(volatile unsigned int*)0x6000001C
#define DER0                    *(volatile unsigned int*)0x60000034
#define DER1                    *(volatile unsigned int*)0x60000054
#define DER2                    *(volatile unsigned int*)0x60000074
#define DER3                    *(volatile unsigned int*)0x60000094
#define DFSR0                   *(volatile unsigned int*)0x60000040
#define DFSR1                   *(volatile unsigned int*)0x60000060
#define DTCR0                   *(volatile unsigned int*)0x60000080
#define DTCR1                   *(volatile unsigned int*)0x600000A0

#define EVENT_ENTRY_HIPRI(x)    *(volatile unsigned int*)(0x61008000 + x*4)
#define EVENT_ENTRY_LOWPRI(x)   *(volatile unsigned int*)(0x62008000 + x*4)

#define TRANSFER_ENTRY_HIPRI(num, word)    *(volatile unsigned int*)(0x610080A0 + num*44 + word*4)
#define TRANSFER_ENTRY_LOWPRI(num, word)   *(volatile unsigned int*)(0x620080A0 + num*44 + word*4)

//---------------------------------
//-----FIFO transfers defines
//Event type
#define ETYPE_FIFO_WRITE         0x00000004l
#define ETYPE_FIFO_READ          0x00000005l
// Enable watermark notification
#define EWN                     (0x1l << 16)
//Reload options
#define RLOAD                   (0x1l << 20)
//Transfer Complete Interrupt enable
#define TCINT                   (0x1l << 22)
// Alternate Transfer Complete Interrupt enable
#define ATCINT                  (0x1l << 23)
// Transfer Complete Code
#define TCC(code)               (code << 24)
// Transfer Synchronization
#define SYNC                    (0x1l << 29)
//Quantum Transfer Limit
#define QTSL_MORE_ONE           (0x0l << 30)
#define QTSL_MORE_FOUR          (0x1l << 30)
#define QTSL_MORE_EIGHT         (0x2l << 30)
#define QTSL_MORE_16            (0x3l << 30)
//
//

//---------------------------------
//-------General purpose transfers defines
// Event type
#define ETYPE_GENERAL_PURPOSE    0x00000003
// Element Size
#define ESIZE_8BIT              (0x0l << 16)
#define ESIZE_16BIT             (0x1l << 16)
#define ESIZE_32BIT             (0x2l << 16)
// Counter Configuration
#define CC(count)               (count << 18)



//PTE
#define PTE(numb)               ( (0x28 + numb*0xB) << 8)   





