avmwww/ittrium/config/tms320c67px/tms320c67px.h
#define CPU_INT_9               0x00020007              
#define CPU_INT_10              0x00030007              
#define CPU_INT_11              0x00040007              
#define CPU_INT_12              0x00050007              
#define CPU_INT_13              0x00060007              
#define CPU_INT_15              0x00070007              

#define WORD_0                  0
#define WORD_1                  1
#define WORD_2                  2
#define WORD_3                  3
#define WORD_4                  4
#define WORD_5                  5
#define WORD_6                  6
#define WORD_7                  7
#define WORD_8                  8
#define WORD_9                  9
#define WORD_10                 10

#define TRANSFER_ENTRY_0        0
#define TRANSFER_ENTRY_1        1
#define TRANSFER_ENTRY_2        2
#define TRANSFER_ENTRY_3        3
#define TRANSFER_ENTRY_4        4
#define TRANSFER_ENTRY_5        5
#define TRANSFER_ENTRY_6        6
#define TRANSFER_ENTRY_7        7

#define EVENT_0                 0x00000001
#define EVENT_1                 0x00000002
#define EVENT_2                 0x00000004
#define EVENT_3                 0x00000008
#define EVENT_4                 0x00000010
#define EVENT_5                 0x00000020
#define EVENT_6                 0x00000040
#define EVENT_7                 0x00000080
#define EVENT_8                 0x00000100
#define EVENT_9                 0x00000200
#define EVENT_10                0x00000400
#define EVENT_11                0x00000800
#define EVENT_12                0x00001000
#define EVENT_13                0x00002000
#define EVENT_14                0x00004000
#define EVENT_15                0x00008000
#define EVENT_16                0x00010000
#define EVENT_17                0x00020000
#define EVENT_18                0x00040000
#define EVENT_19                0x00080000
#define EVENT_20                0x00100000
#define EVENT_21                0x00200000
#define EVENT_22                0x00400000
#define EVENT_23                0x00800000
#define EVENT_24                0x01000000
#define EVENT_26                0x04000000
#define EVENT_27                0x08000000
#define EVENT_28                0x10000000
#define EVENT_29                0x20000000
#define EVENT_30                0x40000000
#define EVENT_31                0x80000000

/*******************************************************************************
SPI Registers
 *******************************************************************************/
#define SPIGCR1_0               *(volatile unsigned int*)0x48000000
#define SPIGCR1_1               *(volatile unsigned int*)0x48000004
#define SPIINT1_0               *(volatile unsigned int*)0x48000008
#define SPILVL1                 *(volatile unsigned int*)0x4800000C
#define SPIFLG1                 *(volatile unsigned int*)0x48000010
#define SPIPC1_0                *(volatile unsigned int*)0x48000014
#define SPIPC1_1                *(volatile unsigned int*)0x48000018
#define SPIPC1_2                *(volatile unsigned int*)0x4800001C
#define SPIPC1_3                *(volatile unsigned int*)0x48000020
#define SPIPC1_4                *(volatile unsigned int*)0x48000024
#define SPIPC1_5                *(volatile unsigned int*)0x48000028
#define SPIDAT1_0               *(volatile unsigned int*)0x48000038
#define SPIDAT1_1               *(volatile unsigned int*)0x4800003C
#define SPIBUF1                 *(volatile unsigned int*)0x48000040
#define SPIEMU1                 *(volatile unsigned int*)0x48000044
#define SPIDELAY1               *(volatile unsigned int*)0x48000048
#define SPIDEF1                 *(volatile unsigned int*)0x4800004C
#define SPIFMT1_0               *(volatile unsigned int*)0x48000050
#define SPIFMT1_1               *(volatile unsigned int*)0x48000054
#define SPIFMT1_2               *(volatile unsigned int*)0x48000058
#define SPIFMT1_3               *(volatile unsigned int*)0x4800005C
#define TGINTVEC1_0             *(volatile unsigned int*)0x48000060
#define TGINTVEC1_1             *(volatile unsigned int*)0x48000064

 

#endif // _TMS320C67PX_H_
